/**
 * @param {string[]} logs
 * @return {number}
 *
 * Файловая система LeetCode ведёт журнал операций, выполняемых
 * пользователями при переходе между папками.
 *
 * Операции описаны следующим образом:
 *   "../" - перейти в родительскую папку текущей папки.
 *           Если мы уже находимся в корневой папке, остаться в ней.
 *
 *   "./"  - остаться в текущей папке.
 *
 *   "x/"  - перейти во вложенную папку с именем x.
 *           Гарантируется, что такая папка всегда существует.
 *
 * Функция принимает массив строк logs, где logs[i] - операция, выполненная
 * пользователем на i-м шаге.
 *
 * Файловая система изначально находится в корневой папке, после чего
 * последовательно выполняются все операции из массива logs.
 *
 * Возвращает минимальное количество операций, необходимых для возвращения
 * в корневую папку после выполнения всех операций перехода между папками.
 */
function minOperations(logs) {

  // Создание переменной для отслеживания текущего уровня вложенности папок
  // относительно корня.
  //
  // Начальное значение 0 означает главную (корневую) директорию, а числа
  // больше 0 - глубину подпапок.
  let depth = 0;

  // Перебираем все значения в массиве logs
  for (const log of logs) {

    // Если текущая команда равна '../', это означает попытку перехода в
    // родительскую папку
    if (log === '../') {

      // Если мы находимся не в главной папке (глубина больше 0), уменьшаем
      // глубину на 1
      if (depth > 0) depth--;

      // Если команда не '../', и не './' (остаться на месте), то в этом
      // случае команда является переходом в подпапку ('x/'), поэтому
      // увеличиваем глубину вложенности на 1
    } else if (log !== './') {
      depth++;
    }
  }

  // Возвращаем итоговое значение depth, которое показывает минимальное
  // количество шагов для возврата в главную папку
  return depth;
}
