/**
 * @param {string} haystack
 * @param {string} needle
 * @return {number}
 *
 * strStr принимает две строки: needle и haystack.
 *
 * Возвращает индекс первого вхождения строки needle в строке haystack или
 * -1, если needle не является частью строки haystack.
 *
 *
 * Пример для:
 *   haystack = "sadbutsad",
 *   needle = "sad"
 * Результат:
 *   0
 * Пояснение:
 *   Подстрока "sad" встречается на индексах 0 и 6.
 *
 *   Первое вхождение находится на индексе 0, поэтому мы возвращаем 0.
 */
function strStr(haystack, needle) {

  // Сохраняем длину исходной строки haystack в константу n
  const n = haystack.length;

  // Сохраняем длину искомой подстроки needle в константу m
  const m = needle.length;

  // Если исходная строка короче искомой подстроки, то вхождение невозможно,
  // возвращаем -1
  if (n < m) return -1;

  // Запускаем цикл от 0 до n - m, так как искать подстроку длиннее
  // оставшейся части haystack нет смысла
  for (let i = 0; i <= n - m; i++) {

    // Инициализируем переменную j для отслеживания текущего индекса в
    // подстроке needle
    let j = 0;

    // Запускаем цикл, который проверяет совпадение символов, пока j меньше
    // длины needle
    while (

      // Проверяем, что индекс j не вышел за пределы длины подстроки needle
      j < m

      // И что символ в haystack со смещением i + j совпадает с текущим
      // символом в needle
      && haystack[i + j] === needle[j]

      // Если условия выполняются, увеличиваем j на 1 для проверки
      // следующего символа
    ) j++;

    // После выхода из цикла while проверяем, равен ли счетчик j длине
    // подстроки m.
    //
    // Если равен, значит, цикл не прервался досрочно и все символы
    // полностью совпали.
    //
    // Возвращаем i - стартовый индекс совпадения.
    if (j === m) return i;
  }

  // Если цикл завершился и совпадение не было найдено, возвращаем -1.
  return -1;
}
