/**
 * @param {string} s
 * @param {string[]} words
 * @return {boolean}
 *
 * isPrefixString принимает строку s и массив строк words. Функция
 * определяет, является ли s префиксной строкой для массива words.
 *
 * Строка s считается префиксной строкой массива words, если её можно
 * получить путём конкатенации первых k строк из массива words для
 * некоторого положительного k, не превышающего words.length.
 *
 * Возвращает true, если s является префиксной строкой массива words, или
 * false в противном случае.
 *
 *
 * Пример для:
 *   s = "iloveleetcode",
 *   words = ["i","love","leetcode","apples"]
 * Результат:
 *   true
 * Пояснение:
 *   Строку s можно получить путём конкатенации строк "i", "love" и
 *   "leetcode" вместе.
 *
 *
 * Пример для:
 *   s = "ilove",
 *   words = ["i","loveleetcode","apples"]
 * Результат:
 *   false
 * Пояснение:
 *   Строка s полностью покрывает первое слово "i", но на втором слове
 *   "loveleetcode" её символы заканчиваются.
 *
 *   Так как слово "loveleetcode" не было покрыто целиком (остался хвост
 *   "leetcode"), строка s не является префиксом массива words.
 */
function isPrefixString(s, words) {
  const n = s.length;

  // Инициализируем указатель i для отслеживания текущего символа в строке s
  let i = 0;

  // Перебираем слова из массива words
  for (const word of words) {
    const m = word.length;

    // Инициализируем указатель j для отслеживания текущего символа в
    // текущем слове word
    let j = 0;

    // Запускаем цикл сравнения символов, пока не дошли до конца строки s
    // или слова word
    while (i < n && j < m) {

      // Если символы в строке s и слове word не совпадают, строка s не
      // может быть префиксной
      if (s[i] !== word[j]) return false;

      // Сдвигаем указатель строки s на следующий символ
      i++;

      // Сдвигаем указатель текущего слова word на следующий символ
      j++;
    }

    // Проверяем, было ли текущее слово word пройдено целиком (j должно
    // стать равным m).
    //
    // Если j меньше m, значит строка s закончилась раньше, чем само слово,
    // что нарушает условие префикса, возвращаем false
    if (j < m) return false;

    // Проверяем, дошли ли мы до самого конца целевой строки s (i стало
    // равным n).
    //
    // Если да, это означает, что строка s успешно и полностью собрана из
    // первых k слов, возвращаем true
    if (i === n) return true;
  }

  // Если цикл по массиву words полностью завершился, но функция не вернула
  // true, это означает, что все слова в массиве закончились, однако строка
  // s не пройдена до конца (i < n). Следовательно, она не может быть
  // префиксной строкой массива words - возвращаем false.
  return false;
}
