/**
 * @param {string} name
 * @param {string} typed
 * @return {boolean}
 *
 * У вас есть друг, который вводит своё имя на клавиатуре. Иногда при вводе
 * символа клавиша может быть зажата (длинное нажатие), что означает, что
 * символ вводится 1 или более раз вместо одного.
 *
 * Даны две строки:
 * - name: имя, которое ваш друг хотел ввести
 * - typed: фактические символы, которые были введены на клавиатуре
 *
 * Функция опеределяет, могла ли строка typed быть результатом ввода строки
 * name, где некоторые символы были зажаты.
 *
 * Возвращает true, если возможно, что typed - это попытка вашего друга
 * ввести name (с возможными длинными нажатиями), и false в противном
 * случае.
 *
 *
 * Пример для:
 *   name = "alex"
 *   typed = "aaleex"
 * Результат:
 *   true
 * Пояснение:
 *   'a' было введено один раз в name, но дважды в typed (длинное нажатие)
 *   'l' было введено по одному разу в обеих строках
 *   'e' было введено один раз в name, но дважды в typed (длинное нажатие)
 *   'x' было введено по одному разу в обеих строках
 *
 *
 * Пример для:
 *   name = "saeed"
 *   typed = "ssaaedd"
 * Результат:
 *   false
 * Пояснение:
 *   Хотя некоторые символы зажаты правильно, в name есть две
 *   последовательные буквы 'e', в то время как в typed только одна 'e'.
 *
 *   Длинное нажатие может только добавлять символы, но не удалять их.
 */
function isLongPressedName(name, typed) {

  // Инициализируем указатель i для отслеживания текущего символа в строке
  // name
  let i = 0;

  // Запускаем цикл с указателем j для перебора каждого символа в строке
  // typed
  for (let j = 0; j < typed.length; j++) {

    // Если текущие символы в name и typed совпадают, продвигаем указатель
    // i вперед
    if (name[i] === typed[j]) i++;

    // Если символы name[i] и typed[j] не совпали, то текущий символ
    // typed[j] может быть только "зажатым" дубликатом.
    //
    // Мы проверяем, отличается ли текущий символ typed[j] от предыдущего
    // символа typed[j - 1]. Если они разные, значит, это посторонний
    // символ (ошибка ввода), либо нарушен порядок букв, либо пропущен
    // символ из name.
    //
    // В этом случае строка typed некорректна, и мы сразу возвращаем false.
    else if (typed[j - 1] !== typed[j]) return false;
  }

  // Когда цикл завершился и вся строка typed успешно проверена, мы должны
  // убедиться, что в name не осталось непроверенных букв.
  //
  // Если указатель i стал равен длине строки name.length, значит, мы
  // полностью и по порядку нашли все буквы имени в строке typed -
  // возвращаем true.
  //
  // Если указатель i меньше длины строки name - в typed не хватило букв,
  // возвращаем false.
  return i === name.length;
}
