/**
 * @param {character[]} letters
 * @param {character} target
 * @return {character}
 *
 * nextGreatestLetter принимает массив символов letters, отсортированный в
 * порядке неубывания, и символ target. В массиве letters есть как минимум
 * два различных символа.
 *
 * Возвращает наименьший символ из letters, который лексикографически
 * больше, чем target. Если такого символа не существует, возвращает первый
 * символ массива.
 *
 * Пример для:
 *   letters = ["c", "f", "j"],
 *   target = "a"
 * Резльтат:
 *   "c"
 * Пояснение:
 *   Наименьший символ в letters, который лексикографически больше "a",
 *   - это "c".
 *
 *
 * Пример для:
 *   letters = ["x", "x", "y", "y"],
 *   target = "z"
 * Результат:
 *   "x"
 * Пояснение:
 *   В массиве letters нет символов, которые лексикографически больше "z",
 *   поэтому возвращаем первый символ массива - letters[0].
 */
function nextGreatestLetter(letters, target) {
  const n = letters.length;

  // Инициализируем указатель левой границы l в значение 0, что
  // соответствует первому элементу массива и началу области поиска
  let l = 0;

  // Инициализируем указатель правой границы r в значение n - 1, что
  // соответствует последнему доступному индексу в массиве
  let r = n - 1;

  // Запускаем цикл, который будет сужать область поиска в два раза на
  // каждой итерации до тех пор, пока указатели l и r не пересекутся
  // (l станет больше r)
  while (l <= r) {

    // Безопасно вычисляем индекс центрального элемента midd текущего
    // диапазона, округляя результат деления вниз. Формула l + (r - l) / 2
    // предотвращает возможное переполнение памяти при работе с очень
    // большими индексами.
    const midd = Math.floor(l + (r - l) / 2);

    // Сравниваем символ в середине текущего диапазона с целевым символом
    // target.
    //
    // Если текущий символ меньше или равен target, то искомого символа
    // (который строго больше target) в левой половине быть не может.
    //
    // Поэтому мы смещаем левую границу l на позицию midd + 1, продолжая
    // поиск в правой части.
    if (letters[midd] <= target) l = midd + 1;

    // Если же символ letters[midd] строго больше target, это значит, что
    // мы нашли потенциального кандидата.
    //
    // Однако левее могут быть символы, которые также больше target, но
    // ближе к нему.
    //
    // Поэтому мы смещаем правую границу r на позицию midd - 1, чтобы
    // продолжить поиск в левой части диапазона.
    else r = midd - 1;
  }

  // По завершении цикла указатель l указывает на индекс первого элемента,
  // который строго больше target.
  //
  // Операция остатка от деления (l % n) реализует кольцевой (циклический)
  // обход массива: если target больше всех элементов массива, l станет
  // равным n (выйдет за пределы массива), и выражение n % n вернет 0, то
  // есть функция корректно вернет самый первый элемент.
  return letters[l % n];
}
