/**
 * @param {number[]} nums
 * @return {void} Do not return anything, modify nums in-place instead.
 *
 * moveZeroes принимет массив целых чисел nums и перемещает все нулевые
 * элементы массива в конец, при этом сохраняет относительный порядок
 * всех ненулевых элементов. Функция изменяет переданный массив на
 * месте (in‑place).
 *
 *
 * Пример для:
 *   nums = [0,1,0,3,12]
 * Результат:
 *   [1,3,12,0,0]
 */
function moveZeroes(nums) {

  // Инициализация указателя l (left) со значением 0.
  //
  // l указывает на позицию, куда нужно поместить следующий найденный
  // ненулевой элемент.
  //
  // Инвариант:
  // Все индексы < l уже содержат окончательные ненулевые элементы в
  // правильном порядке.
  let l = 0;

  // Цикл for с указателем r (right), который проходит по всем индексам
  // массива от 0 до nums.length - 1;
  //
  // r отвечает за поиск следующего ненулевого элемента.
  for (let r = 0; r < nums.length; r++) {

    // Если текущий элемент равен 0, ничего не делаем и переходим к
    // следующему индексу.
    //
    // Это сохраняет нули "на месте" до тех пор, пока не встретится
    // ненулевой элемент для обмена.
    if (nums[r] === 0) continue;

    // Сохраняем текущее значение в позиции l во временную переменную
    // tmp перед обменом.
    //
    // Это нужно, потому что мы перезапишем nums[l].
    const tmp = nums[l];

    // Перемещаем найденный ненулевой элемент из позиции r в позицию l.
    //
    // Это сдвигает ненулевые элементы влево, сохраняя их относительный
    // порядок
    nums[l] = nums[r];

    // Возвращаем сохранённое значение в позицию r.
    //
    // В позицию r записывается ранее сохранённое значение tmp.
    //
    // Если l и r различаются, то на место r попадёт старое сохраненное
    // значение из l, часто это ноль.
    //
    // Таким образом нули окажутся в конце массива nums
    nums[r] = tmp;


    // Увеличиваем указатель l, так как позиция l теперь занята
    // ненулевым элементом.
    l++;
  }
}
