/**
 * @param {string} date
 * @return {string}
 *
 * reformatDate принимает строку с датой в формате День Месяц Год, где:
 * - День принадлежит множеству
 *   {"1st", "2nd", "3rd", "4th", ..., "30th", "31st"}.
 *
 * - Месяц принадлежит множеству
 *   {"Jan", "Feb", "Mar", "Apr", "May", "Jun", "Jul", "Aug", "Sep", "Oct",
 *   "Nov", "Dec"}.
 *
 * - Год находится в диапазоне [1900, 2100].
 *
 * Функция преобразовывает строку с датой в формат YYYY-MM-DD, где:
 * - YYYY означает 4-значный год.
 * - MM означает 2-значный месяц.
 * - DD означает 2-значный день.
 *
 *
 * Пример для:
 *   date = "20th Oct 2052"
 * Результат:
 *   "2052-10-20"
 */
function reformatDate(date) {

  // Создаём Map для быстрого и эффективного поиска номера месяца по его
  // текстовому ключу
  const monthToNumber = new Map([
    ['Jan', '01'], ['Feb', '02'], ['Mar', '03'], ['Apr', '04'],
    ['May', '05'], ['Jun', '06'], ['Jul', '07'], ['Aug', '08'],
    ['Sep', '09'], ['Oct', '10'], ['Nov', '11'], ['Dec', '12']
  ]);

  // Разбиваем входную строку по пробелам на массив из трёх элементов:
  // [день, месяц, год].
  const dateComponents = date.split(' ');

  // Берем 1-й элемент массива dateComponents[0] (например, "20th").
  //
  // Функция parseInt извлекает из начала строки цифры 20 и игнорирует
  // буквы "th", возвращая число 20.
  //
  // Метод toString() превращает число обратно в строку "20".
  //
  // padStart(2, '0') проверяет длину: если строка короче 2 символов
  // (например, "5"), она дописывает '0' в начало (делая "05"), если уже 2
  // символа ("20"), оставляет без изменений.
  const dayOfMonth = parseInt(dateComponents[0]).toString().padStart(2, '0');

  // Получаем номер месяца в виде строкового значения из Map по его
  // названию (второй элемент массива).
  const monthNumber = monthToNumber.get(dateComponents[1]);

  // Извлекаем четырёхзначный год (третий элемент массива), который уже
  // находится в нужном текстовом формате.
  const year = dateComponents[2];

  // Возвращаем итоговую строку в формате YYYY-MM-DD, используя шаблонные
  // литералы для склеивания компонентов даты через дефис.
  return `${year}-${monthNumber}-${dayOfMonth}`;
}
